from aiogram.types import (InlineKeyboardButton, InlineKeyboardMarkup,
                           KeyboardButton, ReplyKeyboardMarkup)
from settings import WORDS, REVIEWS_CHANNEL, DEVELOPER_DIALOG


async def tg_reply_keyboard(buttons: list):
    markup = ReplyKeyboardMarkup(resize_keyboard=True)
    for row in buttons:
        row_buttons = []
        for button in row:
            row_buttons.append(KeyboardButton(button))
        markup.row(*row_buttons)
    return markup


async def steps_keyboards(**kwargs):
    step = kwargs['step']
    if 'rec_1' in kwargs:
        rec_1 = kwargs['rec_1']
    if 'synonyms' in kwargs:
        synonyms = kwargs['synonyms']
    if 'word_p_1' in kwargs:
        word_p_1 = kwargs['word_p_1']
    if 'Word_p' in kwargs:
        word_p = kwargs['Word_p']
    if 'Feeling_1' in kwargs:
        feeling_1 = kwargs['Feeling_1']
    if 'Argument_1' in kwargs:
        argument_1 = kwargs['Argument_1']
    if 'Situation_1' in kwargs:
        situation_1 = kwargs['Situation_1']
    if 'Situation_2' in kwargs:
        situation_2 = kwargs['Situation_2']
    if 'Nforecast_1' in kwargs:
        nforecast_1 = kwargs['Nforecast_1']
    if step == '4':
        buttons = [
            ['🤥 Сопротивление действовать'],
            ['👿 Негативные эмоции'],
            ['📄 Подсказка'],
            [f'👍 Запрос "{rec_1}" решен'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '4.4.4.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡️ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '4.4.5':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '4.4.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '4.4.9':
        buttons = [
            [f'🔴 Да, есть и прогнозируется {nforecast_1}'],
            [f'🔹 Да, есть, но {nforecast_1} не прогнозируется'],
            ['🙂 Нет сопротивления действовать'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '4.5.2':
        buttons = [
            [f'➡ Продолжить прорабатывать сопротивление'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '4.5.5':
        buttons = [
            [f'➡ Продолжить прорабатывать сопротивление'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '4.5.8':
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    elif step == '5.1.2':
        buttons = [
            ['📄 Подсказка'],
            ['◀ Назад'],
            [f'👍 Запрос "{rec_1}" решен'],
            ['👉 Меню']
        ]
    elif step == '5.3.11.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '5.3.13':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['◀ Назад'], ['👉 Меню']]
    elif step == '5.3.14':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '5.3.18':
        buttons = [
            [f'🔴 ГНЕВ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 ГНЕВ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '5.3.21':
        buttons = [
            [f'▶️ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '5.3.24':
        buttons = [
            [f'➡ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '5.3.27': 
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    elif step == '5.4.12.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '5.4.13':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '5.4.14':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '5.4.18':
        buttons = [
            [f'🔴 ГНЕВ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 ГНЕВ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '5.4.21':
        buttons = [
            [f'▶️ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '5.4.24':
        buttons = [
            [f'➡ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '5.4.27': 
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    elif step == '6.2.6':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '6.2.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '6.2.11':
        buttons = [
            [f'🔴 ПЕЧАЛЬ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 ПЕЧАЛЬ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '6.2.14':
        buttons = [
            [f'▶️ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '6.2.17':
        buttons = [
            [f'➡ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '6.2.20': 
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    elif step == '6.3.17.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '6.3.18':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '6.3.19':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '6.3.23':
        buttons = [
            [f'🔴 ПЕЧАЛЬ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 ПЕЧАЛЬ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '6.3.26':
        buttons = [
            [f'▶️ Вернуться к {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '6.3.29':
        buttons = [
            [f'➡ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '6.3.32': 
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    elif step == '7.2.5':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '7.2.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '7.2.9':
        buttons = [
            [f'🔴 СТЫД и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 СТЫД по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '7.3.2':
        buttons = [
            [f'▶️ Вернуться к ситуаци {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '7.3.5':
        buttons = [
            [f'➡ Вернуться к запросу {rec_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '7.3.8':
        buttons = [
            [f'➡ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '7.5.4.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '7.5.5':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '7.5.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '7.5.9':
        buttons = [
            [f'🔴 СТЫД и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 СТЫД по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '7.6.2':
        buttons = [
            [f'▶️ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '7.6.5':
        buttons = [
            [f'➡ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '7.6.8':
        buttons = [
            [f'➡ Вернуться к запросу {rec_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    #---------------------------------------------------------
    elif step == '8.2.5':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '8.2.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '8.2.9':
        buttons = [
            [f'🔴 НЕПРИЯЗНЬ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 НЕПРИЯЗНЬ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '8.3.2':
        buttons = [
            [f'▶️ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '8.3.5':
        buttons = [
            [f'➡ Вернуться к запросу {rec_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '8.5.4.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '8.5.5':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '8.5.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '8.5.9':
        buttons = [
            [f'🔴 НЕПРИЯЗНЬ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 НЕПРИЯЗНЬ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '8.6.2':
        buttons = [
            [f'▶️ Продолжить прорабатывать {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '8.6.5':
        buttons = [
            [f'➡ Вернуться к запросу {rec_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '8.6.8':
        buttons = [
            [f'➡ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    # -------------------------------------------------------
    elif step == '9.2.4.1':
        buttons = [
            ['💡 Вспомнить другую ситуацию'],
            [f'➡ Продолжить с ситуацией {situation_2}']
        ]
    elif step == '9.2.5':
        buttons = [[word_p]]
        buttons += [[i] for i in synonyms] + [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '9.2.7':
        buttons = [[f'⭐ Нужны синонимы к {word_p}'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']]
    elif step == '9.2.9':
        buttons = [
            [f'🔴 СТРАХ и {feeling_1} от {argument_1}'],
            ['🔶 Другая эмоция'],
            ['🔹 СТРАХ по другой причине'],
            ['🙂 Ничего неприятного не чувствую'],
            ['📅 Записаться на сеанс со специалистом'],
            ['◀ Назад'],
            ['👉 Меню']
        ]
    elif step == '9.3.2':
        buttons = [
            [f'▶️ Вернуться к ситуации {situation_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            # ['◀ Назад'],
            # ['👉 Меню']
        ]
    elif step == '9.3.5':
        buttons = [
            [f'➡ Вернуться к запросу {rec_1}'],
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
        ]
    elif step == '9.3.8':
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    elif step == '6.3.8':
        buttons = [
            ['🤗 Как отблагодарить'],
            ['💌 Оставить отзыв'],
            [f'▶️ Вернуться к запросу {rec_1}'],
        ]
    return await tg_reply_keyboard(buttons)


async def menu_keyboard(**kwargs):
    buttons = [
        ['🚀 Начать проработку'],
        ['📝 Инструкция по использованию бота', '📒 О психотехнике'],
        ['📊 Статистика', '⚡️ Рассказать друзьям'],
        ['🤗 Как отблагодарить', '👋 Обратная связь'],
        ['💚 Отзывы'],
        ['📅 Записаться на сеанс со специалистом'],
        ['️🤝 Проработать сопротивление обратиться к психологу'],

    ]
    if 'rec_1' in kwargs:
        rec_1 = kwargs['rec_1']
        buttons.append([f'🔻 Продолжить прорабатывать запрос {rec_1}'])
    return await tg_reply_keyboard(buttons)


async def about_psychotechnisc_keyboard(**kwargs):
    markup = InlineKeyboardMarkup()
    markup.row(
        InlineKeyboardButton('www.LDOU.ru', url='https://LDOU.ru')
    )
    return markup


async def see_reviews_channel_keyboard(**kwargs):
    markup = InlineKeyboardMarkup()
    markup.row(
        InlineKeyboardButton('Посмотреть отзывы', url=f'http://t.me/{REVIEWS_CHANNEL.replace("@", "")}')
    )
    return markup


async def make_appointment(**kwargs):
    markup = InlineKeyboardMarkup()
    markup.row(
        InlineKeyboardButton(
            '✅ Да',
            url=f'http://t.me/{DEVELOPER_DIALOG.replace("@", "")}',
            callback_data='/specialist_yes'),
        InlineKeyboardButton('❌ Нет', callback_data='/specialist_no')
    )
    return markup

async def make_video(**kwargs):
    markup = InlineKeyboardMarkup()
    markup.row(
        InlineKeyboardButton('😡 Проработка гнева', url='youtube.com'),
    )
    markup.row(
        InlineKeyboardButton('😢 Проработка печали', url='youtube.com')
    )
    markup.row(
        InlineKeyboardButton('😬 Проработка стыда', url='youtube.com')
    )
    markup.row(
        InlineKeyboardButton('😤 Проработка неприязни', url='youtube.com')
    )
    markup.row(
        InlineKeyboardButton('😱 Проработка страха', url='youtube.com')
    )
    return markup

async def video_resistance(**kwargs):
    markup = InlineKeyboardMarkup()
    markup.row(
        InlineKeyboardButton('🤥 Проработка сопротивления действовать', url='youtube.com'),
    )
    return markup


KEYBOARDS = {
    'start_keyboard': [
        ['✍ Осознаю']
    ],
    'simple_menu_keyboard': [
        ['👉 Меню']
    ],
    'realize_keyboard': menu_keyboard,
    'how_thanks_keyboard': [
        ['🖍 Ввести свою сумму'],
        ['5000 руб. (≈ корзина продуктов)'],
        ['2500 руб. (≈бак бензина)'],
        ['1000 руб. (≈билеты в кино)'],
        ['500 руб. (≈тортик или коробка конфет)'],
        ['150 руб. (≈чашка кофе)'],
        ['😒 Есть сопротивление поддержать'],
        ['⚡️ Рассказать друзьям'],
        ['💌 Оставить отзыв'],
        ['💸 Что такое донэйшн?'],
        ['👉 Меню']
    ],
    'about_psychotechnics_keyboard': about_psychotechnisc_keyboard,
    'manual_keyboard': [
        ['👉 Меню'],
        ['🎬 Видео-пример проработки Негативных эмоций'],
        ['🎬 Видео-пример проработки Сопротивления действовать']
    ],
    'resistance_keyboard': video_resistance,
    'support_resistance_keyboard': [
        ['⚡️ Рассказать друзьям'],
        ['🤗 Как отблагодарить'],
        ['👉 Меню'],
        ['💸 Что такое донэйшн?'],
    ],
    'write_sum_keyboard': [
        ['👉 Меню']
    ],
    'set_sum_keyboard': [
        ['🔵 Рубли'],
        ['⚪️ Крипто'],
        ['👉 Меню']
    ],
    'statistic_keyboard': [
        ['👉 Меню'],
        ['Удалить статистику пользователя']
    ],
    'reviews_keyboard': [
        ['📖 Посмотреть отзывы'],
        ['💌 Оставить отзыв'],
        ['👉 Меню']
    ],
    'see_reviews_channel_keyboard': see_reviews_channel_keyboard,
    'set_reviews_channel_keyboard': [
        ['📖 Посмотреть отзывы'],
        ['👉 Меню']
    ],
    'give_reviews_keyboard': [
        ['👉 Меню']
    ],
    'feedback_keyboard': [
        ['🤙 Разработчики'],
        ['📒 О психотехнике ЛДОУ'],
        ['💌 Оставить отзыв'],
        ['🌎 Наш сайт'],
        ['👉 Меню'],
    ],
    'session_specialist_keyboard': make_appointment,
    'negative_keyboard': make_video,
    'STEPS': {
        '2': [
            ['Я Мужчина', 'Я Женщина'],
            ['◀ Назад'],
            ['👉 Меню']
        ],
        '3': [['📄 Подсказка'], ['◀ ️Назад']],
        '4': steps_keyboards,
        '4.1': '',
        '4.2': '',
        '4.1.2': '',
        '4.1.3': '',
        '4.1.4': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '4.2.2': [['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '4.3.1': '',
        '4.3.2': '',
        '4.3.3': '',
        '4.3.4': '',
        '4.3.5': '',
        '4.3.6': '',
        '4.3.7': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '4.4.3': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '4.4.4': '',
        '4.4.4.1': steps_keyboards,
        '4.4.5': steps_keyboards,
        '4.4.7': steps_keyboards,
        '4.4.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '4.4.9': steps_keyboards,
        '4.5.2': steps_keyboards,
        '4.5.5': steps_keyboards,
        '4.5.8': steps_keyboards,

        ###############################
        # Негативные эмоции
        ###############################
        '5.1.2': steps_keyboards,
        '5.1.3': [
            ['😡 Гнев', '😱 Страх'],
            ['😤 Неприязнь', '😢 Печаль'],
            ['😬 Стыд'],
            ['🙂 Ничего негативного не испытываю'],
            ['📄 Подсказка'],
            ['◀ Назад'],
            ['👉 Меню']
        ],

        # Ветка гнев

        '5.2.1': '',
        '5.2.2': '',
        '5.2.3': '',
        '5.2.4': '',
        '5.2.5': [['✅ Да', '❌ Нет'], ['Назад'], ['👉 Меню']],
        '5.3.1': '',
        '5.3.2': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '5.3.4': '',
        '5.3.5': '',
        '5.3.6': '',
        '5.3.7': '',
        '5.3.8': '',
        '5.3.8.1': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '5.3.9': [['✅ Да', '❌ Нет'], ['Назад'], ['👉 Меню']],
        # '5.3.11': [['Да', 'Нет'], ['Назад'], ['👉 Меню']],
        '5.3.11': '',
        '5.3.11.1': steps_keyboards,
        '5.3.13': steps_keyboards,
        '5.3.14': steps_keyboards,
        '5.3.15': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '5.3.18': steps_keyboards,
        '5.3.21': steps_keyboards,
        '5.3.24': steps_keyboards,
        '5.3.27': steps_keyboards,

        '5.4.1': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '5.4.3': '',
        '5.4.4': '',
        '5.4.5': '',
        '5.4.6': '',
        '5.4.7': '',
        '5.4.8': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '5.4.10': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '5.4.12': '',
        '5.4.12.1': steps_keyboards,
        '5.4.13': steps_keyboards,
        '5.4.14': steps_keyboards,
        '5.4.15': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '5.4.18': steps_keyboards,
        '5.4.21': steps_keyboards,
        '5.4.24': steps_keyboards,
        '5.4.27': steps_keyboards,

        # Ветка печальглупость
        '6.1.1': [['💔 От потери возможности взаимодействия'], ['😔 По другой причине'], ['📄 Подсказка']],
        '6.2.1': '',
        '6.2.2': '',
        '6.2.3': '',
        '6.2.4': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '6.2.5': '',
        '6.2.6': steps_keyboards,
        '6.2.7': steps_keyboards,
        '6.2.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '6.2.11': steps_keyboards,
        '6.2.14': steps_keyboards,
        '6.2.17': steps_keyboards,
        '6.2.20': steps_keyboards,
        '6.3.1': '',
        '6.3.2': '',
        '6.3.3': '',
        '6.3.4': '',
        '6.3.5': '',
        '6.3.6': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '6.3.8': '',
        '6.3.9': '',
        '6.3.10': '',
        '6.3.11': '',
        '6.3.12': '',
        '6.3.13': [['✅ Да', '❌ Нет'], ['📄 Подсказка'], ['◀ Назад'], ['👉 Меню']],
        '6.3.15': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '6.3.17': '',
        '6.3.17.1': steps_keyboards,
        '6.3.18': steps_keyboards,
        '6.3.19': steps_keyboards,
        '6.3.20': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '6.3.23': steps_keyboards,
        '6.3.26': steps_keyboards,
        '6.3.29': steps_keyboards,
        '6.3.32': steps_keyboards,
        # ветка стыд
        '7.1.1': [['😬👈 На себя'], ['😬👉 Испанский стыд']],
        '7.1.1.3': [['😤👉 На оппонента'], ['😤👈 На себя']],
        '7.1.2': '',
        '7.1.3': '',
        '7.1.4': '',
        '7.1.5': '',
        '7.1.5.1': '',
        '7.1.6': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '7.1.6.1': '',
        '7.1.6.2': '',
        '7.1.7': '',
        '7.1.8': '',
        '7.1.9': '',
        '7.2.0': '',
        '7.2.1': '',
        '7.2.2': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '7.2.2.0': '',
        '7.2.2.1': '',
        '7.2.3': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '7.2.3.0': '',
        '7.2.3.1': '',
        '7.2.4': '',
        '7.2.4.1': '',
        '7.2.5': steps_keyboards,
        '7.2.7': steps_keyboards,
        '7.2.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '7.2.9': steps_keyboards,
        '7.3.2': steps_keyboards,
        '7.3.5': steps_keyboards,
        '7.3.8': steps_keyboards,
        # инверсия (неприязнь)
        '7.4.0': '',
        '7.4.1': '',
        '7.4.2': '',
        '7.4.3': '',
        '7.4.4': '',
        '7.4.5': '',
        '7.4.6': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '7.4.7': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '7.4.8': steps_keyboards,
        '7.5.4': '',
        '7.5.4.1': steps_keyboards,
        '7.5.5': steps_keyboards,
        '7.5.7': steps_keyboards,
        '7.5.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '7.5.9': steps_keyboards,
        '7.6.2': steps_keyboards,
        '7.6.5': steps_keyboards,
        '7.6.8': steps_keyboards,
        # ветка неприязнь
        '8.1.1': [['😤👉 На оппонента'], ['😤👈 На себя']],
        '8.1.1.3': [['😬👈 На себя'], ['😬👉 Испанский стыд']],
        '8.1.2': '',
        '8.1.3': '',
        '8.1.4': '',
        '8.1.5': '',
        '8.1.6': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '8.1.6.1': '',
        '8.1.6.2': '',
        '8.1.7': '',
        '8.1.8': '',
        '8.1.9': '',
        '8.2.0': '',
        '8.2.1': '',
        '8.2.2': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '8.2.2.0': '',
        '8.2.2.1': '',
        '8.2.3': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '8.2.3.0': '',
        '8.2.3.1': '',
        '8.2.4': '',
        '8.2.4.1': '',
        '8.2.5': steps_keyboards,
        '8.2.7': steps_keyboards,
        '8.2.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '8.2.9': steps_keyboards,
        '8.3.2': steps_keyboards,
        '8.3.5': steps_keyboards,
        '8.3.8': steps_keyboards,
        # инверсия (стыд)
        '8.4.0': '',
        '8.4.1': '',
        '8.4.2': '',
        '8.4.3': '',
        '8.4.4': '',
        '8.4.5': '',
        '8.4.6': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '8.4.7': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '8.4.8': steps_keyboards,
        '8.5.4': '',
        '8.5.4.1': steps_keyboards,
        '8.5.5': steps_keyboards,
        '8.5.7': steps_keyboards,
        '8.5.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '8.5.9': steps_keyboards,
        '8.6.2': steps_keyboards,
        '8.6.5': steps_keyboards,
        '8.6.8': steps_keyboards,
        # ветка страха
        '9.1.1': '',
        '9.1.2': '',
        '9.1.3': '',
        '9.1.4': '',
        '9.1.5': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '9.1.6': '',
        '9.1.7': '',
        '9.1.8': '',
        '9.1.9': '',
        '9.2.0': '',
        '9.2.1': '',
        '9.2.2': [['📄 Подсказка'], ['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '9.2.2.0': '',
        '9.2.2.1': '',
        '9.2.3': [['✅ Да', '❌ Нет'], ['◀ Назад'], ['👉 Меню']],
        '9.2.3.0': '',
        '9.2.3.1': '',
        '9.2.4': '',
        '9.2.4.1': steps_keyboards,
        '9.2.5': steps_keyboards,
        '9.2.7': steps_keyboards,
        '9.2.8': [['✅ Да', '❌ Нет'], ['📅 Записаться на сеанс со специалистом'], ['◀ Назад'], ['👉 Меню']],
        '9.2.9': steps_keyboards,
        '9.3.2': steps_keyboards,
        '9.3.5': steps_keyboards,
        '9.3.8': steps_keyboards,




    }
}
